app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"
---
  def index
    @reservations = Reservation.all

INSERT INTO "reservations" ("created_at", "date", "email", "message", "time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-07-21 21:59:29.657547"], ["date", "2014-07-30"], ["email", "mike@hotmail.com"], ["message", "Hello!"], ["time", "13:30"], ["updated_at", "2014-07-21 21:59:29.657547"]]
---
  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save

DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 1]]
---
  def destroy
    @reservation.destroy

SELECT  "reservations".* FROM "reservations"  WHERE "reservations"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_reservation
      @reservation = Reservation.find(params[:id])