app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def edit
      @reservations = Restaurant.find_by_id(@restaurant).reservations
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @restaurant = Restaurant.new(restaurant_params)

    @restaurant.owner = current_owner

    respond_to do |format|

      if @restaurant.save
---
INSERT INTO "restaurants" ("created_at", "name", "phone_number", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-07-07 19:36:07.915125"], ["name", "Dan's43"], ["phone_number", "1-555-555-5555"], ["updated_at", "2014-07-07 19:36:07.915125"]]

  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "description" = $1, "full_address" = $2, "phone_number" = $3, "updated_at" = $4 WHERE "restaurants"."id" = 4  [["description", "Best Pizza shop on earth!"], ["full_address", "23 Ford Street"], ["phone_number", "123-123-1231"], ["updated_at", "2014-07-09 16:23:26.274029"]]

  def destroy
    @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 9]]

    def set_restaurant
      @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 9]]